; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p6---int100n150-m25---int100c150---s56---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level6 level6)
(sum level0 level15 level15)
(sum level0 level19 level19)
(sum level0 level21 level21)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level6 level7)
(sum level1 level15 level16)
(sum level1 level19 level20)
(sum level1 level21 level22)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level6 level8)
(sum level2 level15 level17)
(sum level2 level19 level21)
(sum level2 level21 level23)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level6 level9)
(sum level3 level15 level18)
(sum level3 level19 level22)
(sum level3 level21 level24)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level6 level10)
(sum level4 level15 level19)
(sum level4 level19 level23)
(sum level4 level21 level25)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level6 level11)
(sum level5 level15 level20)
(sum level5 level19 level24)
(sum level5 level21 level26)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level6 level12)
(sum level6 level15 level21)
(sum level6 level19 level25)
(sum level6 level21 level27)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level6 level13)
(sum level7 level15 level22)
(sum level7 level19 level26)
(sum level7 level21 level28)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level6 level14)
(sum level8 level15 level23)
(sum level8 level19 level27)
(sum level8 level21 level29)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level6 level15)
(sum level9 level15 level24)
(sum level9 level19 level28)
(sum level9 level21 level30)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level6 level16)
(sum level10 level15 level25)
(sum level10 level19 level29)
(sum level10 level21 level31)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level6 level17)
(sum level11 level15 level26)
(sum level11 level19 level30)
(sum level11 level21 level32)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level6 level18)
(sum level12 level15 level27)
(sum level12 level19 level31)
(sum level12 level21 level33)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level6 level19)
(sum level13 level15 level28)
(sum level13 level19 level32)
(sum level13 level21 level34)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level6 level20)
(sum level14 level15 level29)
(sum level14 level19 level33)
(sum level14 level21 level35)
(sum level14 level23 level37)
(sum level15 level1 level16)
(sum level15 level6 level21)
(sum level15 level15 level30)
(sum level15 level19 level34)
(sum level15 level21 level36)
(sum level15 level23 level38)
(sum level16 level1 level17)
(sum level16 level6 level22)
(sum level16 level15 level31)
(sum level16 level19 level35)
(sum level16 level21 level37)
(sum level16 level23 level39)
(sum level17 level1 level18)
(sum level17 level6 level23)
(sum level17 level15 level32)
(sum level17 level19 level36)
(sum level17 level21 level38)
(sum level17 level23 level40)
(sum level18 level1 level19)
(sum level18 level6 level24)
(sum level18 level15 level33)
(sum level18 level19 level37)
(sum level18 level21 level39)
(sum level18 level23 level41)
(sum level19 level1 level20)
(sum level19 level6 level25)
(sum level19 level15 level34)
(sum level19 level19 level38)
(sum level19 level21 level40)
(sum level19 level23 level42)
(sum level20 level1 level21)
(sum level20 level6 level26)
(sum level20 level15 level35)
(sum level20 level19 level39)
(sum level20 level21 level41)
(sum level20 level23 level43)
(sum level21 level1 level22)
(sum level21 level6 level27)
(sum level21 level15 level36)
(sum level21 level19 level40)
(sum level21 level21 level42)
(sum level21 level23 level44)
(sum level22 level1 level23)
(sum level22 level6 level28)
(sum level22 level15 level37)
(sum level22 level19 level41)
(sum level22 level21 level43)
(sum level22 level23 level45)
(sum level23 level1 level24)
(sum level23 level6 level29)
(sum level23 level15 level38)
(sum level23 level19 level42)
(sum level23 level21 level44)
(sum level23 level23 level46)
(sum level24 level1 level25)
(sum level24 level6 level30)
(sum level24 level15 level39)
(sum level24 level19 level43)
(sum level24 level21 level45)
(sum level24 level23 level47)
(sum level25 level1 level26)
(sum level25 level6 level31)
(sum level25 level15 level40)
(sum level25 level19 level44)
(sum level25 level21 level46)
(sum level25 level23 level48)
(sum level26 level1 level27)
(sum level26 level6 level32)
(sum level26 level15 level41)
(sum level26 level19 level45)
(sum level26 level21 level47)
(sum level26 level23 level49)
(sum level27 level1 level28)
(sum level27 level6 level33)
(sum level27 level15 level42)
(sum level27 level19 level46)
(sum level27 level21 level48)
(sum level27 level23 level50)
(sum level28 level1 level29)
(sum level28 level6 level34)
(sum level28 level15 level43)
(sum level28 level19 level47)
(sum level28 level21 level49)
(sum level28 level23 level51)
(sum level29 level1 level30)
(sum level29 level6 level35)
(sum level29 level15 level44)
(sum level29 level19 level48)
(sum level29 level21 level50)
(sum level29 level23 level52)
(sum level30 level1 level31)
(sum level30 level6 level36)
(sum level30 level15 level45)
(sum level30 level19 level49)
(sum level30 level21 level51)
(sum level30 level23 level53)
(sum level31 level1 level32)
(sum level31 level6 level37)
(sum level31 level15 level46)
(sum level31 level19 level50)
(sum level31 level21 level52)
(sum level31 level23 level54)
(sum level32 level1 level33)
(sum level32 level6 level38)
(sum level32 level15 level47)
(sum level32 level19 level51)
(sum level32 level21 level53)
(sum level32 level23 level55)
(sum level33 level1 level34)
(sum level33 level6 level39)
(sum level33 level15 level48)
(sum level33 level19 level52)
(sum level33 level21 level54)
(sum level33 level23 level56)
(sum level34 level1 level35)
(sum level34 level6 level40)
(sum level34 level15 level49)
(sum level34 level19 level53)
(sum level34 level21 level55)
(sum level34 level23 level57)
(sum level35 level1 level36)
(sum level35 level6 level41)
(sum level35 level15 level50)
(sum level35 level19 level54)
(sum level35 level21 level56)
(sum level35 level23 level58)
(sum level36 level1 level37)
(sum level36 level6 level42)
(sum level36 level15 level51)
(sum level36 level19 level55)
(sum level36 level21 level57)
(sum level36 level23 level59)
(sum level37 level1 level38)
(sum level37 level6 level43)
(sum level37 level15 level52)
(sum level37 level19 level56)
(sum level37 level21 level58)
(sum level37 level23 level60)
(sum level38 level1 level39)
(sum level38 level6 level44)
(sum level38 level15 level53)
(sum level38 level19 level57)
(sum level38 level21 level59)
(sum level38 level23 level61)
(sum level39 level1 level40)
(sum level39 level6 level45)
(sum level39 level15 level54)
(sum level39 level19 level58)
(sum level39 level21 level60)
(sum level39 level23 level62)
(sum level40 level1 level41)
(sum level40 level6 level46)
(sum level40 level15 level55)
(sum level40 level19 level59)
(sum level40 level21 level61)
(sum level40 level23 level63)
(sum level41 level1 level42)
(sum level41 level6 level47)
(sum level41 level15 level56)
(sum level41 level19 level60)
(sum level41 level21 level62)
(sum level42 level1 level43)
(sum level42 level6 level48)
(sum level42 level15 level57)
(sum level42 level19 level61)
(sum level42 level21 level63)
(sum level43 level1 level44)
(sum level43 level6 level49)
(sum level43 level15 level58)
(sum level43 level19 level62)
(sum level44 level1 level45)
(sum level44 level6 level50)
(sum level44 level15 level59)
(sum level44 level19 level63)
(sum level45 level1 level46)
(sum level45 level6 level51)
(sum level45 level15 level60)
(sum level46 level1 level47)
(sum level46 level6 level52)
(sum level46 level15 level61)
(sum level47 level1 level48)
(sum level47 level6 level53)
(sum level47 level15 level62)
(sum level48 level1 level49)
(sum level48 level6 level54)
(sum level48 level15 level63)
(sum level49 level1 level50)
(sum level49 level6 level55)
(sum level50 level1 level51)
(sum level50 level6 level56)
(sum level51 level1 level52)
(sum level51 level6 level57)
(sum level52 level1 level53)
(sum level52 level6 level58)
(sum level53 level1 level54)
(sum level53 level6 level59)
(sum level54 level1 level55)
(sum level54 level6 level60)
(sum level55 level1 level56)
(sum level55 level6 level61)
(sum level56 level1 level57)
(sum level56 level6 level62)
(sum level57 level1 level58)
(sum level57 level6 level63)
(sum level58 level1 level59)
(sum level59 level1 level60)
(sum level60 level1 level61)
(sum level61 level1 level62)
(sum level62 level1 level63)

(connected l0 l1)
(fuelcost level1 l0 l1)
(connected l0 l2)
(fuelcost level15 l0 l2)
(connected l0 l3)
(fuelcost level19 l0 l3)
(connected l1 l0)
(fuelcost level1 l1 l0)
(connected l1 l2)
(fuelcost level23 l1 l2)
(connected l1 l3)
(fuelcost level21 l1 l3)
(connected l2 l0)
(fuelcost level15 l2 l0)
(connected l2 l1)
(fuelcost level23 l2 l1)
(connected l2 l3)
(fuelcost level6 l2 l3)
(connected l3 l0)
(fuelcost level19 l3 l0)
(connected l3 l1)
(fuelcost level21 l3 l1)
(connected l3 l2)
(fuelcost level6 l3 l2)

(at t0 l1)
(fuel t0 level63)
(= (total-cost) 0)

(at p0 l3)
(at p1 l3)
(at p2 l1)
(at p3 l1)
(at p4 l1)
(at p5 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l0)
(at p2 l2)
(at p3 l2)
(at p4 l3)
(at p5 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 6
2. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 6
3. (drive t0 l1 l0 level62 level1 level63)
   deleted: (at t0 l1) (fuel t0 level63)
   added: (at t0 l0) (fuel t0 level62)
   goals met: 0 of 6
4. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 6
5. (drive t0 l0 l3 level43 level19 level62)
   deleted: (at t0 l0) (fuel t0 level62)
   added: (at t0 l3) (fuel t0 level43)
   goals met: 0 of 6
6. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 1 of 6
7. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 2 of 6
8. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 2 of 6
9. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 2 of 6
10. (drive t0 l3 l0 level24 level19 level43)
   deleted: (at t0 l3) (fuel t0 level43)
   added: (at t0 l0) (fuel t0 level24)
   goals met: 2 of 6
11. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 3 of 6
12. (drive t0 l0 l1 level23 level1 level24)
   deleted: (at t0 l0) (fuel t0 level24)
   added: (at t0 l1) (fuel t0 level23)
   goals met: 3 of 6
13. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 3 of 6
14. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 4 of 6
15. (drive t0 l1 l2 level0 level23 level23)
   deleted: (at t0 l1) (fuel t0 level23)
   added: (at t0 l2) (fuel t0 level0)
   goals met: 4 of 6
16. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 5 of 6
17. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 6 of 6
